
# Taps

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/fuse"
tap "homebrew/science"
tap "homebrew/services"
tap "homebrew/versions"
tap "neovim/neovim"

# Development
brew "coreutils"
brew "go"
brew "rust"

brew "hub"

brew "ghq"
brew "git"

# Tools
brew "htop"
brew "iftop"
brew "direnv"
brew "jq"
brew "kubectx"
cask "keycastr"
cask "osxfuse"
cask "docker"

brew "docker-compose", link: false

# Development: NLP
brew "mecab"
brew "mecab-ipadic"
brew "mecab-unidic"


brew "zsh", args: ["without-etcdir"]

brew "gettext"
brew "docker", link: false
brew "cscope"
brew "ctags"
brew "docker-machine", link: false
brew "docker-compose", link: false
brew "fzf"
brew "global"
brew "graphviz"
brew "grep"
brew "neovim"
brew "nmap"
brew "pandoc"
brew "parallel"
brew "php@5.6", link: true
brew "python"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "sshfs"
brew "terminal-notifier"
brew "tmux"
brew "tree"
brew "w3m"
brew "watch"
cask "calibre"
cask "gitify"
cask "mactex"
cask "minikube"
