
# Taps

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/fuse"
tap "homebrew/science"
tap "homebrew/services"
tap "homebrew/versions"
tap "neovim/neovim"
tap "sanemat/font"

cask "java"
cask "osxfuse"
cask "xquartz"
brew "apple-gcc42"
brew "autoconf"
brew "automake"
brew "boost"
brew "boost-python"
brew "freetype"
brew "gettext"
brew "pixman"
brew "cctools"
brew "docker", link: false
brew "circleci", link: false
brew "clblas"
brew "coreutils"
brew "cpanminus"
brew "cscope"
brew "ctags"
brew "czmq"
brew "go"
brew "dep"
brew "direnv"
brew "dnsmasq", restart_service: true
brew "docker-machine", link: false
brew "docker-compose", link: false
brew "help2man"
brew "fatsort"
brew "findutils"
brew "icu4c"
brew "libtool"
brew "pango"
brew "fontforge"
brew "fzf"
brew "gawk"
brew "isl"
brew "gcc"
brew "ghq"
brew "git"
brew "global"
brew "gnu-sed"
brew "gobject-introspection"
brew "graphviz"
brew "grep"
brew "hdf5"
brew "heroku"
brew "htop"
brew "hub"
brew "iftop"
brew "imagemagick"
brew "jemalloc"
brew "jq"
brew "kubectx"
brew "libevent"
brew "libsodium"
brew "libvterm"
brew "little-cms2"
brew "lua"
brew "lua@5.1"
brew "luabind"
brew "luajit"
brew "mecab"
brew "mecab-ipadic"
brew "mecab-unidic"
brew "msgpack"
brew "mysql-connector-c++"
brew "unibilium"
brew "neovim"
brew "nkf"
brew "nmap"
brew "nvm"
brew "open-mpi"
brew "openjpeg"
brew "pandoc"
brew "parallel"
brew "peco"
brew "php@5.6", link: true
brew "poppler", args: ["with-qt"]
brew "postgresql"
brew "protobuf"
brew "pv"
brew "pyenv"
brew "python"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "redpen"
brew "rename"
brew "ripgrep"
brew "siege"
brew "sshfs"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "tree"
brew "utf8proc"
brew "w3m"
brew "watch"
brew "wdiff"
brew "wget"
brew "yajl"
brew "zsh", args: ["without-etcdir"]
brew "sanemat/font/ricty"
cask "calibre"
cask "docker"
cask "gfxcardstatus"
cask "gitify"
cask "growlnotify"
cask "keycastr"
cask "mactex"
cask "minikube"
cask "shiftit"
cask "tcl"
